#pragma once

namespace Ionic
{
	namespace Zlib
{
	class InflateCodes : public Object // 0x0
	{
	public:
		int* tree; // 0x10 (size: 0x8, flags: 0x3, type: 0x1d)
		int* ltree; // 0x18 (size: 0x8, flags: 0x3, type: 0x1d)
		int* dtree; // 0x20 (size: 0x8, flags: 0x3, type: 0x1d)
		int mode; // 0x28 (size: 0x4, flags: 0x3, type: 0x8)
		int len; // 0x2c (size: 0x4, flags: 0x3, type: 0x8)
		int tree_index; // 0x30 (size: 0x4, flags: 0x3, type: 0x8)
		int need; // 0x34 (size: 0x4, flags: 0x3, type: 0x8)
		int lit; // 0x38 (size: 0x4, flags: 0x3, type: 0x8)
		int bitsToGet; // 0x3c (size: 0x4, flags: 0x3, type: 0x8)
		int dist; // 0x40 (size: 0x4, flags: 0x3, type: 0x8)
		unsigned char lbits; // 0x44 (size: 0x1, flags: 0x3, type: 0x5)
		unsigned char dbits; // 0x45 (size: 0x1, flags: 0x3, type: 0x5)
		int ltree_index; // 0x48 (size: 0x4, flags: 0x3, type: 0x8)
		int dtree_index; // 0x4c (size: 0x4, flags: 0x3, type: 0x8)
	}; // size = 0x50
}
