#pragma once

#include "..\System\UInt16.h"

namespace rust 
{
	class LZ4HC_Data_Structure : public Object // 0x0
	{
	public:
		unsigned char* src; // 0x10 (size: 0x8, flags: 0x6, type: 0x1d)
		unsigned char* dst; // 0x18 (size: 0x8, flags: 0x6, type: 0x1d)
		int* hashTable; // 0x20 (size: 0x8, flags: 0x6, type: 0x1d)
		System::UInt16* chainTable; // 0x28 (size: 0x8, flags: 0x6, type: 0x1d)
		int src_base; // 0x30 (size: 0x4, flags: 0x6, type: 0x8)
		int src_end; // 0x34 (size: 0x4, flags: 0x6, type: 0x8)
		int src_LASTLITERALS; // 0x38 (size: 0x4, flags: 0x6, type: 0x8)
		int dst_base; // 0x3c (size: 0x4, flags: 0x6, type: 0x8)
		int dst_len; // 0x40 (size: 0x4, flags: 0x6, type: 0x8)
		int dst_end; // 0x44 (size: 0x4, flags: 0x6, type: 0x8)
		int nextToUpdate; // 0x48 (size: 0x4, flags: 0x6, type: 0x8)
	}; // size = 0x50
}
