#pragma once

#include "..\UnityEngine\UnicodeString*.h"

namespace rust 
{
	class ConsoleVar : public Attribute // 0x0
	{
	public:
		UnityEngine::UnicodeString* Name; // 0x10 (size: 0x8, flags: 0x6, type: 0xe)
		UnityEngine::UnicodeString* Help; // 0x18 (size: 0x8, flags: 0x6, type: 0xe)
		bool ClientAdmin; // 0x20 (size: 0x1, flags: 0x6, type: 0x2)
		bool ServerAdmin; // 0x21 (size: 0x1, flags: 0x6, type: 0x2)
		bool ServerUser; // 0x22 (size: 0x1, flags: 0x6, type: 0x2)
		bool Saved; // 0x23 (size: 0x1, flags: 0x6, type: 0x2)
		bool ClientInfo; // 0x24 (size: 0x1, flags: 0x6, type: 0x2)
		bool Clientside; // 0x25 (size: 0x1, flags: 0x6, type: 0x2)
		bool Serverside; // 0x26 (size: 0x1, flags: 0x6, type: 0x2)
		bool EditorOnly; // 0x27 (size: 0x1, flags: 0x6, type: 0x2)
		bool AllowRunFromServer; // 0x28 (size: 0x1, flags: 0x6, type: 0x2)
	}; // size = 0x30
}
