#pragma once

namespace UnityEngine
{
	namespace Networking
{
	class NetworkHash128 : public ValueType // 0x0
	{
	public:
		unsigned char i0; // 0x10 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i1; // 0x11 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i2; // 0x12 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i3; // 0x13 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i4; // 0x14 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i5; // 0x15 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i6; // 0x16 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i7; // 0x17 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i8; // 0x18 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i9; // 0x19 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i10; // 0x1a (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i11; // 0x1b (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i12; // 0x1c (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i13; // 0x1d (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i14; // 0x1e (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char i15; // 0x1f (size: 0x1, flags: 0x6, type: 0x5)
	}; // size = 0x20
}
