#pragma once

#include "..\System\Int16.h"

namespace System
{
	namespace IO
{
{
		namespace Ports
{
	class DCB : public Object // 0x0
	{
	public:
		int dcb_length; // 0x10 (size: 0x4, flags: 0x6, type: 0x8)
		int baud_rate; // 0x14 (size: 0x4, flags: 0x6, type: 0x8)
		int flags; // 0x18 (size: 0x4, flags: 0x6, type: 0x8)
		System::Int16 w_reserved; // 0x1c (size: 0x2, flags: 0x6, type: 0x6)
		System::Int16 xon_lim; // 0x1e (size: 0x2, flags: 0x6, type: 0x6)
		System::Int16 xoff_lim; // 0x20 (size: 0x2, flags: 0x6, type: 0x6)
		unsigned char byte_size; // 0x22 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char parity; // 0x23 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char stop_bits; // 0x24 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char xon_char; // 0x25 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char xoff_char; // 0x26 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char error_char; // 0x27 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char eof_char; // 0x28 (size: 0x1, flags: 0x6, type: 0x5)
		unsigned char evt_char; // 0x29 (size: 0x1, flags: 0x6, type: 0x5)
		System::Int16 w_reserved1; // 0x2a (size: 0x2, flags: 0x6, type: 0x6)
	}; // size = 0x30
}
