#pragma once

namespace System
{
	namespace Net
{
{
		namespace NetworkInformation
{
	class Win32_MIB_IPSTATS : public ValueType // 0x0
	{
	public:
		int Forwarding; // 0x10 (size: 0x4, flags: 0x6, type: 0x8)
		int DefaultTTL; // 0x14 (size: 0x4, flags: 0x6, type: 0x8)
		unsigned int InReceives; // 0x18 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int InHdrErrors; // 0x1c (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int InAddrErrors; // 0x20 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int ForwDatagrams; // 0x24 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int InUnknownProtos; // 0x28 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int InDiscards; // 0x2c (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int InDelivers; // 0x30 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int OutRequests; // 0x34 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int RoutingDiscards; // 0x38 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int OutDiscards; // 0x3c (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int OutNoRoutes; // 0x40 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int ReasmTimeout; // 0x44 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int ReasmReqds; // 0x48 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int ReasmOks; // 0x4c (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int ReasmFails; // 0x50 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int FragOks; // 0x54 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int FragFails; // 0x58 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int FragCreates; // 0x5c (size: 0x4, flags: 0x6, type: 0x9)
		int NumIf; // 0x60 (size: 0x4, flags: 0x6, type: 0x8)
		int NumAddr; // 0x64 (size: 0x4, flags: 0x6, type: 0x8)
		int NumRoutes; // 0x68 (size: 0x4, flags: 0x6, type: 0x8)
	}; // size = 0x70
}
