#pragma once

#include "..\System\Char.h"
#include "..\System\Net\NetworkInformation\NetworkInterfaceType.h"

namespace System
{
	namespace Net
{
{
		namespace NetworkInformation
{
	class Win32_MIB_IFROW : public ValueType // 0x0
	{
	public:
		System::Char* Name; // 0x10 (size: 0x8, flags: 0x1006, type: 0x1d)
		int Index; // 0x18 (size: 0x4, flags: 0x6, type: 0x8)
		System::Net::NetworkInformation::NetworkInterfaceType Type; // 0x1c (size: 0x4, flags: 0x6, type: 0x11)
		int Mtu; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		unsigned int Speed; // 0x24 (size: 0x4, flags: 0x6, type: 0x9)
		int PhysAddrLen; // 0x28 (size: 0x4, flags: 0x6, type: 0x8)
		unsigned char* PhysAddr; // 0x30 (size: 0x8, flags: 0x1006, type: 0x1d)
		unsigned int AdminStatus; // 0x38 (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int OperStatus; // 0x3c (size: 0x4, flags: 0x6, type: 0x9)
		unsigned int LastChange; // 0x40 (size: 0x4, flags: 0x6, type: 0x9)
		int InOctets; // 0x44 (size: 0x4, flags: 0x6, type: 0x8)
		int InUcastPkts; // 0x48 (size: 0x4, flags: 0x6, type: 0x8)
		int InNUcastPkts; // 0x4c (size: 0x4, flags: 0x6, type: 0x8)
		int InDiscards; // 0x50 (size: 0x4, flags: 0x6, type: 0x8)
		int InErrors; // 0x54 (size: 0x4, flags: 0x6, type: 0x8)
		int InUnknownProtos; // 0x58 (size: 0x4, flags: 0x6, type: 0x8)
		int OutOctets; // 0x5c (size: 0x4, flags: 0x6, type: 0x8)
		int OutUcastPkts; // 0x60 (size: 0x4, flags: 0x6, type: 0x8)
		int OutNUcastPkts; // 0x64 (size: 0x4, flags: 0x6, type: 0x8)
		int OutDiscards; // 0x68 (size: 0x4, flags: 0x6, type: 0x8)
		int OutErrors; // 0x6c (size: 0x4, flags: 0x6, type: 0x8)
		int OutQLen; // 0x70 (size: 0x4, flags: 0x6, type: 0x8)
		int DescrLen; // 0x74 (size: 0x4, flags: 0x6, type: 0x8)
		unsigned char* Descr; // 0x78 (size: 0x8, flags: 0x1006, type: 0x1d)
	}; // size = 0x80
}
