#pragma once

namespace rust 
{
	class CustomInfo : public Object // 0x0
	{
	public:
		bool UseGroup; // 0x10 (size: 0x1, flags: 0x6, type: 0x2)
		int DecimalDigits; // 0x14 (size: 0x4, flags: 0x6, type: 0x8)
		int DecimalPointPos; // 0x18 (size: 0x4, flags: 0x6, type: 0x8)
		int DecimalTailSharpDigits; // 0x1c (size: 0x4, flags: 0x6, type: 0x8)
		int IntegerDigits; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		int IntegerHeadSharpDigits; // 0x24 (size: 0x4, flags: 0x6, type: 0x8)
		int IntegerHeadPos; // 0x28 (size: 0x4, flags: 0x6, type: 0x8)
		bool UseExponent; // 0x2c (size: 0x1, flags: 0x6, type: 0x2)
		int ExponentDigits; // 0x30 (size: 0x4, flags: 0x6, type: 0x8)
		int ExponentTailSharpDigits; // 0x34 (size: 0x4, flags: 0x6, type: 0x8)
		bool ExponentNegativeSignOnly; // 0x38 (size: 0x1, flags: 0x6, type: 0x2)
		int DividePlaces; // 0x3c (size: 0x4, flags: 0x6, type: 0x8)
		int Percents; // 0x40 (size: 0x4, flags: 0x6, type: 0x8)
		int Permilles; // 0x44 (size: 0x4, flags: 0x6, type: 0x8)
	}; // size = 0x48
}
