#pragma once

#include "..\System\Int16.h"

namespace System
{
	class Guid : public ValueType // 0x0
	{
	public:
		int _a; // 0x10 (size: 0x4, flags: 0x1, type: 0x8)
		System::Int16 _b; // 0x14 (size: 0x2, flags: 0x1, type: 0x6)
		System::Int16 _c; // 0x16 (size: 0x2, flags: 0x1, type: 0x6)
		unsigned char _d; // 0x18 (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _e; // 0x19 (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _f; // 0x1a (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _g; // 0x1b (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _h; // 0x1c (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _i; // 0x1d (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _j; // 0x1e (size: 0x1, flags: 0x1, type: 0x5)
		unsigned char _k; // 0x1f (size: 0x1, flags: 0x1, type: 0x5)
	}; // size = 0x20
}
