#pragma once

namespace System
{
	namespace IO
{
	class MemoryStream : public Stream // 0x18
	{
	public:
		bool canWrite; // 0x18 (size: 0x1, flags: 0x1, type: 0x2)
		bool allowGetBuffer; // 0x19 (size: 0x1, flags: 0x1, type: 0x2)
		int capacity; // 0x1c (size: 0x4, flags: 0x1, type: 0x8)
		int length; // 0x20 (size: 0x4, flags: 0x1, type: 0x8)
		unsigned char* internalBuffer; // 0x28 (size: 0x8, flags: 0x1, type: 0x1d)
		int initialIndex; // 0x30 (size: 0x4, flags: 0x1, type: 0x8)
		bool expandable; // 0x34 (size: 0x1, flags: 0x1, type: 0x2)
		bool streamClosed; // 0x35 (size: 0x1, flags: 0x1, type: 0x2)
		int position; // 0x38 (size: 0x4, flags: 0x1, type: 0x8)
		int dirty_bytes; // 0x3c (size: 0x4, flags: 0x1, type: 0x8)
	}; // size = 0x40
}
