#pragma once

#include "..\UnityEngine\UnicodeString*.h"
#include "..\System\Globalization\CompareOptions.h"

namespace Mono
{
	namespace Globalization
{
{
		namespace Unicode
{
	class SortKeyBuffer : public Object // 0x0
	{
	public:
		int l1; // 0x10 (size: 0x4, flags: 0x1, type: 0x8)
		int l2; // 0x14 (size: 0x4, flags: 0x1, type: 0x8)
		int l3; // 0x18 (size: 0x4, flags: 0x1, type: 0x8)
		int l4s; // 0x1c (size: 0x4, flags: 0x1, type: 0x8)
		int l4t; // 0x20 (size: 0x4, flags: 0x1, type: 0x8)
		int l4k; // 0x24 (size: 0x4, flags: 0x1, type: 0x8)
		int l4w; // 0x28 (size: 0x4, flags: 0x1, type: 0x8)
		int l5; // 0x2c (size: 0x4, flags: 0x1, type: 0x8)
		unsigned char* l1b; // 0x30 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l2b; // 0x38 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l3b; // 0x40 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l4sb; // 0x48 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l4tb; // 0x50 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l4kb; // 0x58 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l4wb; // 0x60 (size: 0x8, flags: 0x1, type: 0x1d)
		unsigned char* l5b; // 0x68 (size: 0x8, flags: 0x1, type: 0x1d)
		UnityEngine::UnicodeString* source; // 0x70 (size: 0x8, flags: 0x1, type: 0xe)
		bool processLevel2; // 0x78 (size: 0x1, flags: 0x1, type: 0x2)
		bool frenchSort; // 0x79 (size: 0x1, flags: 0x1, type: 0x2)
		bool frenchSorted; // 0x7a (size: 0x1, flags: 0x1, type: 0x2)
		int lcid; // 0x7c (size: 0x4, flags: 0x1, type: 0x8)
		System::Globalization::CompareOptions options; // 0x80 (size: 0x4, flags: 0x1, type: 0x11)
	}; // size = 0x88
}
