#pragma once

#include "..\UnityEngine\Shader.h"
#include "..\UnityEngine\Texture2D.h"
#include "..\UnityEngine\Material.h"

namespace rust 
{
	class NaturalBloomAndDirtyLens : public MonoBehaviour // 0x18
	{
	public:
		UnityEngine::Shader* shader; // 0x18 (size: 0x8, flags: 0x6, type: 0x12)
		UnityEngine::Texture2D* lensDirtTexture; // 0x20 (size: 0x8, flags: 0x6, type: 0x12)
		float* mipWeights; // 0x28 (size: 0x8, flags: 0x6, type: 0x1d)
		UnityEngine::Material* material; // 0x30 (size: 0x8, flags: 0x1, type: 0x12)
		float range; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float cutoff; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float bloomIntensity; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float lensDirtIntensity; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
		float spread; // 0x48 (size: 0x4, flags: 0x6, type: 0xc)
		int iterations; // 0x4c (size: 0x4, flags: 0x6, type: 0x8)
		int mips; // 0x50 (size: 0x4, flags: 0x6, type: 0x8)
		bool highPrecision; // 0x54 (size: 0x1, flags: 0x6, type: 0x2)
		bool downscaleSource; // 0x55 (size: 0x1, flags: 0x6, type: 0x2)
		bool debug; // 0x56 (size: 0x1, flags: 0x6, type: 0x2)
		bool isSupported; // 0x57 (size: 0x1, flags: 0x1, type: 0x2)
		float blurSize; // 0x58 (size: 0x4, flags: 0x1, type: 0xc)
	}; // size = 0x60
}
