#pragma once

#include "..\UnityEngine\UnicodeString*.h"
#include "PathInterpolator.h"

namespace rust 
{
	class PathList : public Object // 0x0
	{
	public:
		UnityEngine::UnicodeString* Name; // 0x10 (size: 0x8, flags: 0x6, type: 0xe)
		PathInterpolator* Path; // 0x18 (size: 0x8, flags: 0x6, type: 0x12)
		bool Spline; // 0x20 (size: 0x1, flags: 0x6, type: 0x2)
		bool Start; // 0x21 (size: 0x1, flags: 0x6, type: 0x2)
		bool End; // 0x22 (size: 0x1, flags: 0x6, type: 0x2)
		float Width; // 0x24 (size: 0x4, flags: 0x6, type: 0xc)
		float Offset; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		float Padding; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
		float Fade; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float Scaling; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		int Topology; // 0x38 (size: 0x4, flags: 0x6, type: 0x8)
		int Splat; // 0x3c (size: 0x4, flags: 0x6, type: 0x8)
	}; // size = 0x40
}
