#pragma once

#include "MusicTheme.h"
#include "MusicClip.h"

namespace rust 
{
	class PositionedClip : public Object // 0x0
	{
	public:
		MusicTheme* theme; // 0x10 (size: 0x8, flags: 0x6, type: 0x12)
		MusicClip* musicClip; // 0x18 (size: 0x8, flags: 0x6, type: 0x12)
		int startingBar; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		int layerId; // 0x24 (size: 0x4, flags: 0x6, type: 0x8)
		float minIntensity; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		float maxIntensity; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
		bool allowFadeIn; // 0x30 (size: 0x1, flags: 0x6, type: 0x2)
		bool allowFadeOut; // 0x31 (size: 0x1, flags: 0x6, type: 0x2)
		float fadeInTime; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		float fadeOutTime; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float intensityReduction; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x40
}
