#pragma once

namespace Smaa
{
	class Preset : public Object // 0x0
	{
	public:
		bool DiagDetection; // 0x10 (size: 0x1, flags: 0x6, type: 0x2)
		bool CornerDetection; // 0x11 (size: 0x1, flags: 0x6, type: 0x2)
		float Threshold; // 0x14 (size: 0x4, flags: 0x6, type: 0xc)
		float DepthThreshold; // 0x18 (size: 0x4, flags: 0x6, type: 0xc)
		int MaxSearchSteps; // 0x1c (size: 0x4, flags: 0x6, type: 0x8)
		int MaxSearchStepsDiag; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		int CornerRounding; // 0x24 (size: 0x4, flags: 0x6, type: 0x8)
		float LocalContrastAdaptationFactor; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x30
}
