#pragma once

#include "GameObjectRef.h"

namespace rust 
{
	class ProjectileWeaponMod : public BaseEntity // 0x130
	{
	public:
		GameObjectRef* defaultSilencerEffect; // 0x130 (size: 0x8, flags: 0x6, type: 0x12)
		bool isSilencer; // 0x138 (size: 0x1, flags: 0x6, type: 0x2)
		Modifier repeatDelay; // 0x13c (size: 0xc, flags: 0x6, type: 0x11)
		Modifier projectileVelocity; // 0x148 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier projectileDamage; // 0x154 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier projectileDistance; // 0x160 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier aimsway; // 0x16c (size: 0xc, flags: 0x6, type: 0x11)
		Modifier aimswaySpeed; // 0x178 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier recoil; // 0x184 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier sightAimCone; // 0x190 (size: 0xc, flags: 0x6, type: 0x11)
		Modifier hipAimCone; // 0x19c (size: 0xc, flags: 0x6, type: 0x11)
		bool isLight; // 0x1a8 (size: 0x1, flags: 0x6, type: 0x2)
		bool isMuzzleBrake; // 0x1a9 (size: 0x1, flags: 0x6, type: 0x2)
		bool isMuzzleBoost; // 0x1aa (size: 0x1, flags: 0x6, type: 0x2)
		bool isScope; // 0x1ab (size: 0x1, flags: 0x6, type: 0x2)
		bool needsOnForEffects; // 0x1ac (size: 0x1, flags: 0x6, type: 0x2)
	}; // size = 0x1b0
}
