#pragma once

namespace rust 
{
	class ReverbSettings : public ScriptableObject // 0x18
	{
	public:
		int room; // 0x18 (size: 0x4, flags: 0x6, type: 0x8)
		int roomHF; // 0x1c (size: 0x4, flags: 0x6, type: 0x8)
		int roomLF; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		float decayTime; // 0x24 (size: 0x4, flags: 0x6, type: 0xc)
		float decayHFRatio; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		int reflections; // 0x2c (size: 0x4, flags: 0x6, type: 0x8)
		float reflectionsDelay; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		int reverb; // 0x34 (size: 0x4, flags: 0x6, type: 0x8)
		float reverbDelay; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float HFReference; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float LFReference; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float diffusion; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
		float density; // 0x48 (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x50
}
