#pragma once

#include "..\UnityEngine\Collider.h"
#include "..\UnityEngine\AudioReverbZone.h"
#include "ReverbSettings.h"
#include "LODCell.h"

namespace rust 
{
	class ReverbZoneTrigger : public TriggerBase // 0x30
	{
	public:
		UnityEngine::Collider* trigger; // 0x30 (size: 0x8, flags: 0x6, type: 0x12)
		UnityEngine::AudioReverbZone* reverbZone; // 0x38 (size: 0x8, flags: 0x6, type: 0x12)
		ReverbSettings* reverbSettings; // 0x40 (size: 0x8, flags: 0x6, type: 0x12)
		LODCell* cell; // 0x48 (size: 0x8, flags: 0x1, type: 0x12)
		float lodDistance; // 0x50 (size: 0x4, flags: 0x6, type: 0xc)
		bool inRange; // 0x54 (size: 0x1, flags: 0x6, type: 0x2)
		int initialReverbLevel; // 0x58 (size: 0x4, flags: 0x1, type: 0x8)
		int targetReverbLevel; // 0x5c (size: 0x4, flags: 0x1, type: 0x8)
		int currentReverbLevel; // 0x60 (size: 0x4, flags: 0x1, type: 0x8)
		float decayHFRatio; // 0x64 (size: 0x4, flags: 0x1, type: 0xc)
		float decayTime; // 0x68 (size: 0x4, flags: 0x1, type: 0xc)
		float density; // 0x6c (size: 0x4, flags: 0x1, type: 0xc)
		float diffusion; // 0x70 (size: 0x4, flags: 0x1, type: 0xc)
		float HFReference; // 0x74 (size: 0x4, flags: 0x1, type: 0xc)
		float LFReference; // 0x78 (size: 0x4, flags: 0x1, type: 0xc)
		float maxDistance; // 0x7c (size: 0x4, flags: 0x1, type: 0xc)
		float minDistance; // 0x80 (size: 0x4, flags: 0x1, type: 0xc)
		int reflections; // 0x84 (size: 0x4, flags: 0x1, type: 0x8)
		float reflectionsDelay; // 0x88 (size: 0x4, flags: 0x1, type: 0xc)
		int reverb; // 0x8c (size: 0x4, flags: 0x1, type: 0x8)
		float reverbDelay; // 0x90 (size: 0x4, flags: 0x1, type: 0xc)
		int room; // 0x94 (size: 0x4, flags: 0x1, type: 0x8)
		int roomHF; // 0x98 (size: 0x4, flags: 0x1, type: 0x8)
		int roomLF; // 0x9c (size: 0x4, flags: 0x1, type: 0x8)
	}; // size = 0xa0
}
