#pragma once

namespace rust 
{
	class TargetDesc : public ValueType // 0x0
	{
	public:
		int fullWidth; // 0x10 (size: 0x4, flags: 0x6, type: 0x8)
		int fullHeight; // 0x14 (size: 0x4, flags: 0x6, type: 0x8)
		int width; // 0x18 (size: 0x4, flags: 0x6, type: 0x8)
		int height; // 0x1c (size: 0x4, flags: 0x6, type: 0x8)
		int quarterWidth; // 0x20 (size: 0x4, flags: 0x6, type: 0x8)
		int quarterHeight; // 0x24 (size: 0x4, flags: 0x6, type: 0x8)
		float padRatioWidth; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		float padRatioHeight; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x30
}
