#pragma once

namespace rust 
{
	class Tick : public ValueType // 0x0
	{
	public:
		int frameRate; // 0x10 (size: 0x4, flags: 0x6, type: 0x8)
		float frameTime; // 0x14 (size: 0x4, flags: 0x6, type: 0xc)
		float frameRateAverage; // 0x18 (size: 0x4, flags: 0x6, type: 0xc)
		float frameTimeAverage; // 0x1c (size: 0x4, flags: 0x6, type: 0xc)
		__int64 memoryAllocations; // 0x20 (size: 0x8, flags: 0x6, type: 0xa)
		__int64 memoryCollections; // 0x28 (size: 0x8, flags: 0x6, type: 0xa)
		__int64 loadBalancerTasks; // 0x30 (size: 0x8, flags: 0x6, type: 0xa)
		__int64 invokeHandlerTasks; // 0x38 (size: 0x8, flags: 0x6, type: 0xa)
		int ping; // 0x40 (size: 0x4, flags: 0x6, type: 0x8)
	}; // size = 0x48
}
