#pragma once

#include "..\UnityEngine\Renderer.h"
#include "..\UnityEngine\Material.h"

namespace rust 
{
	class UVTextureAnimator : public MonoBehaviour // 0x18
	{
	public:
		UnityEngine::Renderer* currentRenderer; // 0x18 (size: 0x8, flags: 0x1, type: 0x12)
		UnityEngine::Material* instanceMaterial; // 0x20 (size: 0x8, flags: 0x1, type: 0x12)
		int Rows; // 0x28 (size: 0x4, flags: 0x6, type: 0x8)
		int Columns; // 0x2c (size: 0x4, flags: 0x6, type: 0x8)
		float Fps; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		int OffsetMat; // 0x34 (size: 0x4, flags: 0x6, type: 0x8)
		bool IsLoop; // 0x38 (size: 0x1, flags: 0x6, type: 0x2)
		float StartDelay; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		bool isInizialised; // 0x40 (size: 0x1, flags: 0x1, type: 0x2)
		int index; // 0x44 (size: 0x4, flags: 0x1, type: 0x8)
		int count; // 0x48 (size: 0x4, flags: 0x1, type: 0x8)
		int allCount; // 0x4c (size: 0x4, flags: 0x1, type: 0x8)
		float deltaFps; // 0x50 (size: 0x4, flags: 0x1, type: 0xc)
		bool isVisible; // 0x54 (size: 0x1, flags: 0x1, type: 0x2)
		bool isCorutineStarted; // 0x55 (size: 0x1, flags: 0x1, type: 0x2)
	}; // size = 0x58
}
