#pragma once

#include "..\UnityEngine\UnicodeString*.h"

namespace ProtoBuf
{
	class Approval : public Object // 0x0
	{
	public:
		UnityEngine::UnicodeString* level; // 0x10 (size: 0x8, flags: 0x86, type: 0xe)
		UnityEngine::UnicodeString* hostname; // 0x18 (size: 0x8, flags: 0x86, type: 0xe)
		UnityEngine::UnicodeString* checksum; // 0x20 (size: 0x8, flags: 0x86, type: 0xe)
		bool modded; // 0x28 (size: 0x1, flags: 0x86, type: 0x2)
		bool official; // 0x29 (size: 0x1, flags: 0x86, type: 0x2)
		unsigned __int64 steamid; // 0x30 (size: 0x8, flags: 0x86, type: 0xb)
		unsigned int ipaddress; // 0x38 (size: 0x4, flags: 0x86, type: 0x9)
		int port; // 0x3c (size: 0x4, flags: 0x86, type: 0x8)
		unsigned int levelSeed; // 0x40 (size: 0x4, flags: 0x86, type: 0x9)
		unsigned int levelSize; // 0x44 (size: 0x4, flags: 0x86, type: 0x9)
		bool ShouldPool; // 0x48 (size: 0x1, flags: 0x6, type: 0x2)
		bool _disposed; // 0x49 (size: 0x1, flags: 0x1, type: 0x2)
	}; // size = 0x50
}
