#pragma once

#include "..\UnityEngine\Vector3.h"

namespace rust 
{
	class EffectData : public Object // 0x0
	{
	public:
		unsigned int type; // 0x10 (size: 0x4, flags: 0x86, type: 0x9)
		unsigned int pooledstringid; // 0x14 (size: 0x4, flags: 0x86, type: 0x9)
		int number; // 0x18 (size: 0x4, flags: 0x86, type: 0x8)
		UnityEngine::Vector3 origin; // 0x1c (size: 0xc, flags: 0x86, type: 0x11)
		UnityEngine::Vector3 normal; // 0x28 (size: 0xc, flags: 0x86, type: 0x11)
		float scale; // 0x34 (size: 0x4, flags: 0x86, type: 0xc)
		unsigned int entity; // 0x38 (size: 0x4, flags: 0x86, type: 0x9)
		unsigned int bone; // 0x3c (size: 0x4, flags: 0x86, type: 0x9)
		unsigned __int64 source; // 0x40 (size: 0x8, flags: 0x86, type: 0xb)
		bool ShouldPool; // 0x48 (size: 0x1, flags: 0x6, type: 0x2)
		bool _disposed; // 0x49 (size: 0x1, flags: 0x1, type: 0x2)
	}; // size = 0x50
}
