#pragma once

#include "..\UnityEngine\Transform.h"

namespace rust 
{
	class MouseOrbit : public MonoBehaviour // 0x18
	{
	public:
		UnityEngine::Transform* target; // 0x18 (size: 0x8, flags: 0x6, type: 0x12)
		float distance; // 0x20 (size: 0x4, flags: 0x6, type: 0xc)
		float xSpeed; // 0x24 (size: 0x4, flags: 0x6, type: 0xc)
		float ySpeed; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		int yMinLimit; // 0x2c (size: 0x4, flags: 0x6, type: 0x8)
		int yMaxLimit; // 0x30 (size: 0x4, flags: 0x6, type: 0x8)
		float x; // 0x34 (size: 0x4, flags: 0x1, type: 0xc)
		float y; // 0x38 (size: 0x4, flags: 0x1, type: 0xc)
	}; // size = 0x40
}
