#pragma once

namespace rust 
{
	class CC_AnalogTV : public CC_Base // 0x28
	{
	public:
		float phase; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		bool grayscale; // 0x2c (size: 0x1, flags: 0x6, type: 0x2)
		float noiseIntensity; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float scanlinesIntensity; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		float scanlinesCount; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float distortion; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float cubicDistortion; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float scale; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x48
}
