#pragma once

namespace rust 
{
	class CC_ChannelMixer : public CC_Base // 0x28
	{
	public:
		float redR; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		float redG; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
		float redB; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float greenR; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		float greenG; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float greenB; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float blueR; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float blueG; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
		float blueB; // 0x48 (size: 0x4, flags: 0x6, type: 0xc)
		float constantR; // 0x4c (size: 0x4, flags: 0x6, type: 0xc)
		float constantG; // 0x50 (size: 0x4, flags: 0x6, type: 0xc)
		float constantB; // 0x54 (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x58
}
