#pragma once

namespace rust 
{
	class CC_Levels : public CC_Base // 0x28
	{
	public:
		int mode; // 0x28 (size: 0x4, flags: 0x6, type: 0x8)
		float inputMinL; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
		float inputMaxL; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float inputGammaL; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		float inputMinR; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float inputMaxR; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float inputGammaR; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float inputMinG; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
		float inputMaxG; // 0x48 (size: 0x4, flags: 0x6, type: 0xc)
		float inputGammaG; // 0x4c (size: 0x4, flags: 0x6, type: 0xc)
		float inputMinB; // 0x50 (size: 0x4, flags: 0x6, type: 0xc)
		float inputMaxB; // 0x54 (size: 0x4, flags: 0x6, type: 0xc)
		float inputGammaB; // 0x58 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMinL; // 0x5c (size: 0x4, flags: 0x6, type: 0xc)
		float outputMaxL; // 0x60 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMinR; // 0x64 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMaxR; // 0x68 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMinG; // 0x6c (size: 0x4, flags: 0x6, type: 0xc)
		float outputMaxG; // 0x70 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMinB; // 0x74 (size: 0x4, flags: 0x6, type: 0xc)
		float outputMaxB; // 0x78 (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x80
}
