#pragma once

#include "MegaWindType.h"
#include "..\UnityEngine\Vector3.h"
#include "MegaWirePerlin.h"
#include "..\UnityEngine\Color.h"

namespace rust 
{
	class MegaWireWind : public MonoBehaviour // 0x18
	{
	public:
		MegaWirePerlin* iperlin; // 0x18 (size: 0x8, flags: 0x1, type: 0x12)
		float decay; // 0x20 (size: 0x4, flags: 0x6, type: 0xc)
		float turb; // 0x24 (size: 0x4, flags: 0x6, type: 0xc)
		float strength; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		MegaWindType type; // 0x2c (size: 0x4, flags: 0x6, type: 0x11)
		float freq; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float scale; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		UnityEngine::Vector3 force; // 0x38 (size: 0xc, flags: 0x6, type: 0x11)
		UnityEngine::Vector3 gizmoSize; // 0x44 (size: 0xc, flags: 0x6, type: 0x11)
		int divs; // 0x50 (size: 0x4, flags: 0x6, type: 0x8)
		bool displayGizmo; // 0x54 (size: 0x1, flags: 0x6, type: 0x2)
		float gizscale; // 0x58 (size: 0x4, flags: 0x6, type: 0xc)
		UnityEngine::Vector3 gizmopos; // 0x5c (size: 0xc, flags: 0x6, type: 0x11)
		UnityEngine::Color gizmocol; // 0x68 (size: 0x10, flags: 0x6, type: 0x11)
		bool dirnoise; // 0x78 (size: 0x1, flags: 0x6, type: 0x2)
		float dirfreq; // 0x7c (size: 0x4, flags: 0x6, type: 0xc)
		float dirphase; // 0x80 (size: 0x4, flags: 0x6, type: 0xc)
		UnityEngine::Vector3 dirscale; // 0x84 (size: 0xc, flags: 0x6, type: 0x11)
		bool strengthnoise; // 0x90 (size: 0x1, flags: 0x6, type: 0x2)
		float strengthfreq; // 0x94 (size: 0x4, flags: 0x6, type: 0xc)
		float strengthphase; // 0x98 (size: 0x4, flags: 0x6, type: 0xc)
		float strengthscale; // 0x9c (size: 0x4, flags: 0x6, type: 0xc)
		UnityEngine::Vector3 dir; // 0xa0 (size: 0xc, flags: 0x6, type: 0x11)
		float t; // 0xac (size: 0x4, flags: 0x6, type: 0xc)
		UnityEngine::Vector3 rotseed; // 0xb0 (size: 0xc, flags: 0x1, type: 0x11)
		float strengthval; // 0xbc (size: 0x4, flags: 0x1, type: 0xc)
		UnityEngine::Vector3 dirval; // 0xc0 (size: 0xc, flags: 0x1, type: 0x11)
	}; // size = 0xd0
}
