#pragma once

namespace UnityEngine
{
	class BoneWeight : public ValueType // 0x0
	{
	public:
		float m_Weight0; // 0x10 (size: 0x4, flags: 0x1, type: 0xc)
		float m_Weight1; // 0x14 (size: 0x4, flags: 0x1, type: 0xc)
		float m_Weight2; // 0x18 (size: 0x4, flags: 0x1, type: 0xc)
		float m_Weight3; // 0x1c (size: 0x4, flags: 0x1, type: 0xc)
		int m_BoneIndex0; // 0x20 (size: 0x4, flags: 0x1, type: 0x8)
		int m_BoneIndex1; // 0x24 (size: 0x4, flags: 0x1, type: 0x8)
		int m_BoneIndex2; // 0x28 (size: 0x4, flags: 0x1, type: 0x8)
		int m_BoneIndex3; // 0x2c (size: 0x4, flags: 0x1, type: 0x8)
	}; // size = 0x30
}
