#pragma once

#include "..\System\Char.h"
#include "..\System\Int16.h"

namespace UnityEngine
{
	class jvalue : public ValueType // 0x0
	{
	public:
		bool z; // 0x10 (size: 0x1, flags: 0x6, type: 0x2)
		unsigned char b; // 0x10 (size: 0x1, flags: 0x6, type: 0x5)
		System::Char c; // 0x10 (size: 0x2, flags: 0x6, type: 0x3)
		System::Int16 s; // 0x10 (size: 0x2, flags: 0x6, type: 0x6)
		int i; // 0x10 (size: 0x4, flags: 0x6, type: 0x8)
		__int64 j; // 0x10 (size: 0x8, flags: 0x6, type: 0xa)
		float f; // 0x10 (size: 0x4, flags: 0x6, type: 0xc)
		double d; // 0x10 (size: 0x8, flags: 0x6, type: 0xd)
		__int64 l; // 0x10 (size: 0x8, flags: 0x6, type: 0x18)
	}; // size = 0x18
}
