#pragma once

namespace UnityEngine
{
	class Matrix4x4 : public ValueType // 0x0
	{
	public:
		float m00; // 0x10 (size: 0x4, flags: 0x6, type: 0xc)
		float m10; // 0x14 (size: 0x4, flags: 0x6, type: 0xc)
		float m20; // 0x18 (size: 0x4, flags: 0x6, type: 0xc)
		float m30; // 0x1c (size: 0x4, flags: 0x6, type: 0xc)
		float m01; // 0x20 (size: 0x4, flags: 0x6, type: 0xc)
		float m11; // 0x24 (size: 0x4, flags: 0x6, type: 0xc)
		float m21; // 0x28 (size: 0x4, flags: 0x6, type: 0xc)
		float m31; // 0x2c (size: 0x4, flags: 0x6, type: 0xc)
		float m02; // 0x30 (size: 0x4, flags: 0x6, type: 0xc)
		float m12; // 0x34 (size: 0x4, flags: 0x6, type: 0xc)
		float m22; // 0x38 (size: 0x4, flags: 0x6, type: 0xc)
		float m32; // 0x3c (size: 0x4, flags: 0x6, type: 0xc)
		float m03; // 0x40 (size: 0x4, flags: 0x6, type: 0xc)
		float m13; // 0x44 (size: 0x4, flags: 0x6, type: 0xc)
		float m23; // 0x48 (size: 0x4, flags: 0x6, type: 0xc)
		float m33; // 0x4c (size: 0x4, flags: 0x6, type: 0xc)
	}; // size = 0x50
}
