#pragma once

namespace UnityEngine
{
	namespace AI
{
	class NavMeshBuildSettings : public ValueType // 0x0
	{
	public:
		int m_AgentTypeID; // 0x10 (size: 0x4, flags: 0x1, type: 0x8)
		float m_AgentRadius; // 0x14 (size: 0x4, flags: 0x1, type: 0xc)
		float m_AgentHeight; // 0x18 (size: 0x4, flags: 0x1, type: 0xc)
		float m_AgentSlope; // 0x1c (size: 0x4, flags: 0x1, type: 0xc)
		float m_AgentClimb; // 0x20 (size: 0x4, flags: 0x1, type: 0xc)
		float m_LedgeDropHeight; // 0x24 (size: 0x4, flags: 0x1, type: 0xc)
		float m_MaxJumpAcrossDistance; // 0x28 (size: 0x4, flags: 0x1, type: 0xc)
		float m_MinRegionArea; // 0x2c (size: 0x4, flags: 0x1, type: 0xc)
		int m_OverrideVoxelSize; // 0x30 (size: 0x4, flags: 0x1, type: 0x8)
		float m_VoxelSize; // 0x34 (size: 0x4, flags: 0x1, type: 0xc)
		int m_OverrideTileSize; // 0x38 (size: 0x4, flags: 0x1, type: 0x8)
		int m_TileSize; // 0x3c (size: 0x4, flags: 0x1, type: 0x8)
		int m_AccuratePlacement; // 0x40 (size: 0x4, flags: 0x1, type: 0x8)
	}; // size = 0x48
}
