#pragma once

namespace UnityEngine
{
	namespace Rendering
{
	class SphericalHarmonicsL2 : public ValueType // 0x0
	{
	public:
		float shr0; // 0x10 (size: 0x4, flags: 0x1, type: 0xc)
		float shr1; // 0x14 (size: 0x4, flags: 0x1, type: 0xc)
		float shr2; // 0x18 (size: 0x4, flags: 0x1, type: 0xc)
		float shr3; // 0x1c (size: 0x4, flags: 0x1, type: 0xc)
		float shr4; // 0x20 (size: 0x4, flags: 0x1, type: 0xc)
		float shr5; // 0x24 (size: 0x4, flags: 0x1, type: 0xc)
		float shr6; // 0x28 (size: 0x4, flags: 0x1, type: 0xc)
		float shr7; // 0x2c (size: 0x4, flags: 0x1, type: 0xc)
		float shr8; // 0x30 (size: 0x4, flags: 0x1, type: 0xc)
		float shg0; // 0x34 (size: 0x4, flags: 0x1, type: 0xc)
		float shg1; // 0x38 (size: 0x4, flags: 0x1, type: 0xc)
		float shg2; // 0x3c (size: 0x4, flags: 0x1, type: 0xc)
		float shg3; // 0x40 (size: 0x4, flags: 0x1, type: 0xc)
		float shg4; // 0x44 (size: 0x4, flags: 0x1, type: 0xc)
		float shg5; // 0x48 (size: 0x4, flags: 0x1, type: 0xc)
		float shg6; // 0x4c (size: 0x4, flags: 0x1, type: 0xc)
		float shg7; // 0x50 (size: 0x4, flags: 0x1, type: 0xc)
		float shg8; // 0x54 (size: 0x4, flags: 0x1, type: 0xc)
		float shb0; // 0x58 (size: 0x4, flags: 0x1, type: 0xc)
		float shb1; // 0x5c (size: 0x4, flags: 0x1, type: 0xc)
		float shb2; // 0x60 (size: 0x4, flags: 0x1, type: 0xc)
		float shb3; // 0x64 (size: 0x4, flags: 0x1, type: 0xc)
		float shb4; // 0x68 (size: 0x4, flags: 0x1, type: 0xc)
		float shb5; // 0x6c (size: 0x4, flags: 0x1, type: 0xc)
		float shb6; // 0x70 (size: 0x4, flags: 0x1, type: 0xc)
		float shb7; // 0x74 (size: 0x4, flags: 0x1, type: 0xc)
		float shb8; // 0x78 (size: 0x4, flags: 0x1, type: 0xc)
	}; // size = 0x80
}
